# Q01

In [9]:
##
## Imprima la cantidad de registros por cada letra 
## de la columna _c1 de la tabla tbl0
##

In [8]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [2]:
tbl0.head()

   _c0 _c1  _c2         _c3
0    0   E    1  1999-02-28
1    1   A    2  1999-10-28
2    2   B    5  1998-05-02
3    3   A    3  1999-08-28
4    4   C    6  1999-12-01

In [7]:
q01 = tbl0.groupby('_c1').count()['_c0']
print(q01)

_c1
A     8
B     7
C     5
D     6
E    14
Name: _c0, dtype: int64

In [10]:
%run q01.py

_c1
A     8
B     7
C     5
D     6
E    14
Name: _c0, dtype: int64

# Q02

In [11]:
##
## Imprima el promedio de la _c2 por cada letra de la _c1 
## de la tabla tbl0
##

In [12]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [16]:
q02 = tbl0.groupby('_c1').mean()['_c2']

In [17]:
print(q02)

_c1
A    4.625000
B    5.142857
C    5.400000
D    3.833333
E    4.785714
Name: _c2, dtype: float64

In [19]:
%run q02.py

_c1
A    4.625000
B    5.142857
C    5.400000
D    3.833333
E    4.785714
Name: _c2, dtype: float64

# Q03

In [20]:
##
## Imprima el maximo de la _c2 por cada letra de la _c1 
## de la tabla tbl0
##

In [24]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [25]:
q03 = tbl0.groupby('_c1').max()['_c2']
print(q03)

_c1
A    9
B    9
C    9
D    7
E    9
Name: _c2, dtype: int64

In [26]:
%run q03.py

_c1
A    9
B    9
C    9
D    7
E    9
Name: _c2, dtype: int64

# Q04

In [27]:
##
## Imprima los valores unicos e la columna _c4 de 
## de la tabla tbl1 en mayusculas
##

In [68]:
import pandas
tbl1 = pandas.read_csv('tbl1.tsv', sep = '\t')

In [73]:
tbl11 = tbl1.copy()

In [74]:
tbl11.head()

   _c0 _c4
0    0   b
1    0   g
2    0   f
3    1   a
4    1   f

In [75]:
unique = tbl11['_c4'].unique()

In [76]:
unique1 = sorted(unique)

In [80]:
unique2 = [n.upper() for n in unique1]

In [81]:
print(unique2)

['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [82]:
%run q04.py

['A', 'B', 'C', 'D', 'E', 'F', 'G']

# Q05

In [ ]:
## Imprima la suma de la _c2 por cada letra de la _c1 
## de la tabla tbl0

In [83]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')
q05 = tbl0.groupby('_c1').sum()['_c2']
print(q05)

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

In [84]:
%run q05.py

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

# Q06

In [ ]:
##
## Imprima la suma de la _c2 por cada letra de la _c1 
## de la tabla tbl0
##

In [85]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')
q06 = tbl0.groupby('_c1').sum()['_c2']
print(q06)

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

In [87]:
%run q06.py

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

# Q07

In [ ]:
##
## Agregue una columna  con la suma de _c0 y _c2 a la tabla tbl0.tsv 
##

In [88]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [89]:
tbl0aux = tbl0.copy()

In [91]:
tbl0aux['suma'] = tbl0aux['_c0'] + tbl0aux['_c2']

In [92]:
print(tbl0aux)

    _c0 _c1  _c2         _c3  suma
0     0   E    1  1999-02-28     1
1     1   A    2  1999-10-28     3
2     2   B    5  1998-05-02     7
3     3   A    3  1999-08-28     6
4     4   C    6  1999-12-01    10
5     5   A    7  1998-07-28    12
6     6   A    9  1997-02-28    15
7     7   B    1  1999-05-10     8
8     8   E    2  1997-04-12    10
9     9   B    3  1999-11-23    12
10   10   C    7  1998-01-17    17
11   11   C    5  1998-12-28    16
12   12   D    3  1999-10-15    15
13   13   E    8  1998-11-01    21
14   14   B    9  1999-08-12    23
15   15   D    1  1997-12-01    16
16   16   E    3  1997-07-28    19
17   17   D    5  1998-08-12    22
18   18   E    8  1999-08-24    26
19   19   E    9  1998-01-23    28
20   20   E    7  1999-06-22    27
21   21   E    3  1999-04-24    24
22   22   D    5  1999-06-25    27
23   23   A    1  1999-08-25    24
24   24   E    4  1997-07-26    28
25   25   E    6  1997-09-24    31
26   26   A    8  1997-09-28    34
27   27   E    5  1999-06-22    32
28   28   A    6  1999-07-29    34
29   29   C    0  1999-08-22    29
30   30   A    1  1998-04-26    31
31   31   D    2  1998-02-24    33
32   32   E    5  1999-03-24    37
33   33   B    4  1998-03-23    37
34   34   B    6  1999-04-21    40
35   35   D    7  1999-02-29    42
36   36   B    8  1997-05-21    44
37   37   C    9  1997-07-22    46
38   38   E    1  1999-09-28    39
39   39   E    5  1998-01-26    44

In [93]:
%run q07.py

    _c0 _c1  _c2         _c3  suma
0     0   E    1  1999-02-28     1
1     1   A    2  1999-10-28     3
2     2   B    5  1998-05-02     7
3     3   A    3  1999-08-28     6
4     4   C    6  1999-12-01    10
5     5   A    7  1998-07-28    12
6     6   A    9  1997-02-28    15
7     7   B    1  1999-05-10     8
8     8   E    2  1997-04-12    10
9     9   B    3  1999-11-23    12
10   10   C    7  1998-01-17    17
11   11   C    5  1998-12-28    16
12   12   D    3  1999-10-15    15
13   13   E    8  1998-11-01    21
14   14   B    9  1999-08-12    23
15   15   D    1  1997-12-01    16
16   16   E    3  1997-07-28    19
17   17   D    5  1998-08-12    22
18   18   E    8  1999-08-24    26
19   19   E    9  1998-01-23    28
20   20   E    7  1999-06-22    27
21   21   E    3  1999-04-24    24
22   22   D    5  1999-06-25    27
23   23   A    1  1999-08-25    24
24   24   E    4  1997-07-26    28
25   25   E    6  1997-09-24    31
26   26   A    8  1997-09-28    34
27   27   E    5  1999-06-22    32
28   28   A    6  1999-07-29    34
29   29   C    0  1999-08-22    29
30   30   A    1  1998-04-26    31
31   31   D    2  1998-02-24    33
32   32   E    5  1999-03-24    37
33   33   B    4  1998-03-23    37
34   34   B    6  1999-04-21    40
35   35   D    7  1999-02-29    42
36   36   B    8  1997-05-21    44
37   37   C    9  1997-07-22    46
38   38   E    1  1999-09-28    39
39   39   E    5  1998-01-26    44

# Q08

In [18]:
##
## Agregue el año como una columna a la tabla tbl0.tsv 
##

In [1]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')
tbl0aux = tbl0.copy()

In [53]:
tbl0aux.head()

   _c0 _c1  _c2         _c3
0    0   E    1  1999-02-28
1    1   A    2  1999-10-28
2    2   B    5  1998-05-02
3    3   A    3  1999-08-28
4    4   C    6  1999-12-01

In [54]:
from datetime import datetime
tbl0aux["_c3"] = pandas.to_datetime(tbl0aux["_c3"], errors='ignore')

In [55]:
tbl0aux.head(2)

   _c0 _c1  _c2        _c3
0    0   E    1 1999-02-28
1    1   A    2 1999-10-28

In [93]:
#En este punto se cambia el tipo de dato series del dataframe para acceder a sus propiedades de fecha (dt = datetime like)
#permitiendo así que se obtengan datos como el año y el mes.
tbl0aux['_c3'].dt

In [57]:
tbl0aux['_c3'].dt.year

0     1999
1     1999
2     1998
3     1999
4     1999
5     1998
6     1997
7     1999
8     1997
9     1999
10    1998
11    1998
12    1999
13    1998
14    1999
15    1997
16    1997
17    1998
18    1999
19    1998
20    1999
21    1999
22    1999
23    1999
24    1997
25    1997
26    1997
27    1999
28    1999
29    1999
30    1998
31    1998
32    1999
33    1998
34    1999
35    1999
36    1997
37    1997
38    1999
39    1998
Name: _c3, dtype: int64

In [58]:
tbl0aux['ano'] = tbl0aux['_c3'].dt.year

In [59]:
print(tbl0aux)

    _c0 _c1  _c2        _c3   ano
0     0   E    1 1999-02-28  1999
1     1   A    2 1999-10-28  1999
2     2   B    5 1998-05-02  1998
3     3   A    3 1999-08-28  1999
4     4   C    6 1999-12-01  1999
5     5   A    7 1998-07-28  1998
6     6   A    9 1997-02-28  1997
7     7   B    1 1999-05-10  1999
8     8   E    2 1997-04-12  1997
9     9   B    3 1999-11-23  1999
10   10   C    7 1998-01-17  1998
11   11   C    5 1998-12-28  1998
12   12   D    3 1999-10-15  1999
13   13   E    8 1998-11-01  1998
14   14   B    9 1999-08-12  1999
15   15   D    1 1997-12-01  1997
16   16   E    3 1997-07-28  1997
17   17   D    5 1998-08-12  1998
18   18   E    8 1999-08-24  1999
19   19   E    9 1998-01-23  1998
20   20   E    7 1999-06-22  1999
21   21   E    3 1999-04-24  1999
22   22   D    5 1999-06-25  1999
23   23   A    1 1999-08-25  1999
24   24   E    4 1997-07-26  1997
25   25   E    6 1997-09-24  1997
26   26   A    8 1997-09-28  1997
27   27   E    5 1999-06-22  1999
28   28   A    6 1999-07-29  1999
29   29   C    0 1999-08-22  1999
30   30   A    1 1998-04-26  1998
31   31   D    2 1998-02-24  1998
32   32   E    5 1999-03-24  1999
33   33   B    4 1998-03-23  1998
34   34   B    6 1999-04-21  1999
35   35   D    7 1999-02-28  1999
36   36   B    8 1997-05-21  1997
37   37   C    9 1997-07-22  1997
38   38   E    1 1999-09-28  1999
39   39   E    5 1998-01-26  1998

In [60]:
%run q08.py

    _c0 _c1  _c2        _c3   ano
0     0   E    1 1999-02-28  1999
1     1   A    2 1999-10-28  1999
2     2   B    5 1998-05-02  1998
3     3   A    3 1999-08-28  1999
4     4   C    6 1999-12-01  1999
5     5   A    7 1998-07-28  1998
6     6   A    9 1997-02-28  1997
7     7   B    1 1999-05-10  1999
8     8   E    2 1997-04-12  1997
9     9   B    3 1999-11-23  1999
10   10   C    7 1998-01-17  1998
11   11   C    5 1998-12-28  1998
12   12   D    3 1999-10-15  1999
13   13   E    8 1998-11-01  1998
14   14   B    9 1999-08-12  1999
15   15   D    1 1997-12-01  1997
16   16   E    3 1997-07-28  1997
17   17   D    5 1998-08-12  1998
18   18   E    8 1999-08-24  1999
19   19   E    9 1998-01-23  1998
20   20   E    7 1999-06-22  1999
21   21   E    3 1999-04-24  1999
22   22   D    5 1999-06-25  1999
23   23   A    1 1999-08-25  1999
24   24   E    4 1997-07-26  1997
25   25   E    6 1997-09-24  1997
26   26   A    8 1997-09-28  1997
27   27   E    5 1999-06-22  1999
28   28   A    6 1999-07-29  1999
29   29   C    0 1999-08-22  1999
30   30   A    1 1998-04-26  1998
31   31   D    2 1998-02-24  1998
32   32   E    5 1999-03-24  1999
33   33   B    4 1998-03-23  1998
34   34   B    6 1999-04-21  1999
35   35   D    7 1999-02-28  1999
36   36   B    8 1997-05-21  1997
37   37   C    9 1997-07-22  1997
38   38   E    1 1999-09-28  1999
39   39   E    5 1998-01-26  1998

In [3]:
#Otra opción
tbl0aux['ano'] = tbl0aux['_c3'].str.slice(0,4)
tbl0aux.head()

   _c0 _c1  _c2         _c3   ano
0    0   E    1  1999-02-28  1999
1    1   A    2  1999-10-28  1999
2    2   B    5  1998-05-02  1998
3    3   A    3  1999-08-28  1999
4    4   C    6  1999-12-01  1999

# Q09

In [75]:
##
## Construya una tabla que contenga _c1 y una lista
## separada por ':' de los valores de la columna _c2
## para el archivo tbl0.tsv
##

In [61]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [62]:
tbl0.head()

   _c0 _c1  _c2         _c3
0    0   E    1  1999-02-28
1    1   A    2  1999-10-28
2    2   B    5  1998-05-02
3    3   A    3  1999-08-28
4    4   C    6  1999-12-01

In [64]:
tbl01 = tbl0.sort_values('_c2') #Ordenar los valores de numero

In [65]:
tbl01.head()

    _c0 _c1  _c2         _c3
29   29   C    0  1999-08-22
0     0   E    1  1999-02-28
15   15   D    1  1997-12-01
23   23   A    1  1999-08-25
7     7   B    1  1999-05-10

In [67]:
tbl01['_c2'] = tbl01['_c2'].apply(str)  #Convertir los valores a string para poder aplicarles la función siguiente

In [69]:
tbl02 = tbl01.groupby('_c1')['_c2'].apply(lambda x: ':'.join(x))

In [70]:
tbl02.head(2)

_c1
A    1:1:2:3:6:7:8:9
B      1:3:4:5:6:8:9
Name: _c2, dtype: object

In [71]:
tbl03 = pandas.DataFrame({'_c0':tbl02.index, 'lista':tbl02.values})
print(tbl03)

  _c0                        lista
0   A              1:1:2:3:6:7:8:9
1   B                1:3:4:5:6:8:9
2   C                    0:5:6:7:9
3   D                  1:2:3:5:5:7
4   E  1:1:2:3:3:4:5:5:5:6:7:8:8:9

In [74]:
%run q09.py

  _c0                        lista
0   A              1:1:2:3:6:7:8:9
1   B                1:3:4:5:6:8:9
2   C                    0:5:6:7:9
3   D                  1:2:3:5:5:7
4   E  1:1:2:3:3:4:5:5:5:6:7:8:8:9

# Q10

In [ ]:
##
## Construya una tabla que contenga _c0 y una lista
## separada por ',' de los valores de la columna _c4
## de la tabla tbl1.tsv
##

In [76]:
import pandas
tbl1 = pandas.read_csv('tbl1.tsv', sep = '\t')

In [77]:
tbl1.head(2)

   _c0 _c4
0    0   b
1    0   g

In [78]:
tbl10 = tbl1.sort_values('_c4')

In [80]:
tbl11 = tbl10.groupby('_c0')['_c4'].apply(lambda x: ','.join(x))

In [81]:
tbl11.head(2)

_c0
0    b,f,g
1    a,c,f
Name: _c4, dtype: object

In [84]:
tbl12 = pandas.DataFrame({'_c0':tbl11.index, 'lista':tbl11.values})
print(tbl12)

    _c0    lista
0     0    b,f,g
1     1    a,c,f
2     2  a,c,e,f
3     3      a,b
4     4  a,d,f,g
5     5      c,d
6     6    a,d,g
7     7      a,b
8     8  a,d,e,f
9     9  b,d,f,g
10   10  b,c,d,f
11   11  a,c,d,e
12   12  b,e,f,g
13   13      c,f
14   14      b,d
15   15      e,f
16   16    b,e,f
17   17      a,g
18   18  a,c,e,f
19   19      a,e
20   20      e,f
21   21    b,c,g
22   22    a,c,f
23   23    a,d,f
24   24      c,d
25   25    c,d,e
26   26    a,e,f
27   27    a,c,g
28   28      e,f
29   29  a,c,f,g
30   30      b,f
31   31      b,f
32   32      a,c
33   33    b,c,f
34   34    a,e,f
35   35      a,f
36   36      a,c
37   37  a,c,e,f
38   38      d,e
39   39    a,d,f

In [85]:
%run q10.py

    _c0    lista
0     0    b,f,g
1     1    a,c,f
2     2  a,c,e,f
3     3      a,b
4     4  a,d,f,g
5     5      c,d
6     6    a,d,g
7     7      a,b
8     8  a,d,e,f
9     9  b,d,f,g
10   10  b,c,d,f
11   11  a,c,d,e
12   12  b,e,f,g
13   13      c,f
14   14      b,d
15   15      e,f
16   16    b,e,f
17   17      a,g
18   18  a,c,e,f
19   19      a,e
20   20      e,f
21   21    b,c,g
22   22    a,c,f
23   23    a,d,f
24   24      c,d
25   25    c,d,e
26   26    a,e,f
27   27    a,c,g
28   28      e,f
29   29  a,c,f,g
30   30      b,f
31   31      b,f
32   32      a,c
33   33    b,c,f
34   34    a,e,f
35   35      a,f
36   36      a,c
37   37  a,c,e,f
38   38      d,e
39   39    a,d,f

# Q11

In [86]:
##
## Construya una tabla que contenga _c0 y una lista
## separada por ',' de los valores de la columna _c5a
## y _c5b (unidos por ':') de la tabla tbl2.tsv
##

In [88]:
import pandas
tbl2 = pandas.read_csv('tbl2.tsv', sep="\t")

In [89]:
tbl2.head(1)

   _c0 _c5a  _c5b
0    0  jjj     3

In [96]:
tbl2['lista'] = tbl2['_c5a']+':'+tbl2['_c5b'].astype(str)

In [97]:
tbl2.head(1)

   _c0 _c5a  _c5b  lista
0    0  jjj     3  jjj:3

In [100]:
tbl20 = tbl2.groupby('_c0')['lista'].apply(lambda x:','.join(x))

In [101]:
print(tbl20)

_c0
0           jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1                 ccc:2,ddd:0,aaa:3,hhh:9
2                 ddd:2,ggg:5,ccc:6,jjj:1
3                 hhh:9,iii:5,eee:7,bbb:1
4                 iii:6,ddd:5,eee:4,jjj:3
5           bbb:2,hhh:0,ccc:4,fff:1,aaa:7
6     aaa:5,fff:8,ddd:2,iii:0,jjj:7,ccc:1
7                       fff:3,hhh:1,ddd:2
8     eee:4,ccc:5,iii:9,fff:7,ggg:6,bbb:0
9     bbb:7,jjj:9,fff:5,iii:4,ggg:2,eee:3
10          hhh:6,eee:4,iii:0,fff:2,jjj:1
11                      bbb:7,iii:6,ggg:9
12          bbb:9,aaa:3,ccc:6,fff:4,eee:2
13                      aaa:8,ddd:5,jjj:1
14          ccc:0,jjj:6,fff:7,ddd:3,aaa:2
15                ccc:0,eee:6,bbb:9,ddd:3
16    bbb:6,iii:3,hhh:5,fff:4,ggg:9,ddd:2
17                      hhh:4,jjj:5,ccc:9
18                      ccc:1,iii:6,fff:9
19                      bbb:9,aaa:3,fff:1
20                      ddd:9,iii:2,aaa:4
21                      ccc:5,fff:8,iii:7
22                      eee:3,jjj:2,ddd:7
23          jjj:1,ggg:0,ccc:7,ddd:9,bbb:3
24    jjj:6,ccc:0,aaa:1,hhh:9,iii:7,ggg:8
25    fff:3,eee:6,iii:4,bbb:7,ddd:0,ccc:1
26                      fff:0,ddd:5,ccc:4
27          ggg:6,hhh:3,ddd:9,ccc:0,jjj:7
28          hhh:6,jjj:0,eee:5,iii:7,ccc:3
29    eee:1,fff:4,aaa:2,ccc:7,ggg:0,ddd:6
30          ccc:6,aaa:9,eee:5,ddd:0,bbb:3
31    bbb:7,hhh:1,aaa:6,iii:4,fff:9,ddd:5
32                fff:3,ccc:1,ggg:2,eee:5
33    iii:7,ggg:3,ddd:0,jjj:8,hhh:5,ccc:1
34          hhh:6,ccc:3,jjj:0,bbb:8,ddd:7
35                      aaa:0,fff:5,ddd:3
36          ddd:5,jjj:2,iii:7,ccc:0,bbb:4
37                      eee:0,fff:2,hhh:6
38                      fff:9,iii:2,eee:0
39                      hhh:8,ggg:3,jjj:5
Name: lista, dtype: object

# Q12

In [103]:
## Si la columna _c0 es la clave en las tablas tbl0.tsv
## y tbl2.tsv, compute la suma de tbl2._c5b por cada
## valor en tbl0._c1.

In [104]:
import pandas

In [106]:
tbl0 = pandas.read_csv('tbl0.tsv', sep='\t')
tbl1 = pandas.read_csv('tbl1.tsv', sep='\t')
tbl2 = pandas.read_csv('tbl2.tsv', sep='\t')

In [107]:
tbl0.head(2)

   _c0 _c1  _c2         _c3
0    0   E    1  1999-02-28
1    1   A    2  1999-10-28

In [108]:
tbl1.head(2)

   _c0 _c4
0    0   b
1    0   g

In [109]:
tbl2.head(2)

   _c0 _c5a  _c5b
0    0  jjj     3
1    0  bbb     0

In [110]:
tbl21 = tbl2.groupby('_c5a')['_c5b'].sum()

In [112]:
print(tbl21)

_c5a
aaa    53
bbb    82
ccc    72
ddd    98
eee    55
fff    94
ggg    61
hhh    80
iii    86
jjj    67
Name: _c5b, dtype: int64

In [113]:
%run q12.py

_c5a
aaa    53
bbb    82
ccc    72
ddd    98
eee    55
fff    94
ggg    61
hhh    80
iii    86
jjj    67
Name: _c5b, dtype: int64